Tekla Open API Reference for Tekla Structures 2025
DetailTypeAttribute Class
 The DetailTypeAttribute class is used for storing the detail type. Based on the type the system will then position the detail in the creation. The attribute is initialized from the custom attribute [DetailType(DetailTypeEnum.END)] in the connection source.
Inheritance Hierarchy
System.Object
 System.Attribute
 Tekla.Structures.Plugins.DetailTypeAttribute
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class DetailTypeAttribute : Attribute
Public NotInheritable Class DetailTypeAttribute
	Inherits Attribute
The DetailTypeAttribute type exposes the following members.
Constructors
Name | Description
DetailTypeAttribute(Int32)
 The custom attribute [DetailType()] uses this to store the type of the detail to the system. This is not to be used by itself.
DetailTypeAttribute(DetailTypeEnum)
 The custom attribute [DetailType()] uses this to store the type of the detail to the system. This is not to be used by itself.
Top
Properties
Name | Description
Type
 The custom attribute [DetailType()] uses this to store the type of the detail to the system. This is not to be used by itself.
Top
See Also
Reference
Tekla.Structures.Plugins Namespace